TexasInstruments/mcupsdk-core/test/drivers/gpmc/am263x-cc/r5fss0-0_nortos/example.syscfg
section1.load_memory                  = "R5F_VECS";
section1.group                        = false;
section1.$name                        = "Vector Table";
section1.output_section.create(1);
section1.output_section[0].$name      = ".vectors";
section1.output_section[0].palignment = true;

section2.load_memory                  = "OCRAM";
section2.$name                        = "Text Segments";
section2.output_section.create(5);
section2.output_section[0].$name      = ".text.hwi";
section2.output_section[0].palignment = true;
section2.output_section[1].$name      = ".text.cache";
section2.output_section[1].palignment = true;
section2.output_section[2].$name      = ".text.mpu";
section2.output_section[2].palignment = true;
section2.output_section[3].$name      = ".text.boot";
section2.output_section[3].palignment = true;
section2.output_section[4].$name      = ".text:abort";
section2.output_section[4].palignment = true;

section3.load_memory                  = "OCRAM";
section3.$name                        = "Code and Read-Only Data";
section3.output_section.create(2);
section3.output_section[0].$name      = ".text";
section3.output_section[0].palignment = true;
section3.output_section[1].$name      = ".rodata";
section3.output_section[1].palignment = true;

section4.load_memory                  = "OCRAM";
section4.$name                        = "Data Segment";
section4.output_section.create(1);
section4.output_section[0].$name      = ".data";
section4.output_section[0].palignment = true;

section5.load_memory                             = "OCRAM";
section5.$name                                   = "Memory Segments";
section5.output_section.create(3);
section5.output_section[0].$name                 = ".bss";
section5.output_section[0].output_sections_start = "__BSS_START";
section5.output_section[0].output_sections_end   = "__BSS_END";
section5.output_section[0].palignment            = true;
section5.output_section[1].$name                 = ".sysmem";
section5.output_section[1].palignment            = true;
section5.output_section[2].$name                 = ".stack";
section5.output_section[2].palignment            = true;

section6.load_memory                              = "OCRAM";
section6.$name                                    = "Stack Segments";
section6.output_section.create(5);
section6.output_section[0].$name                  = ".irqstack";
section6.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section6.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section6.output_section[0].input_section.create(1);
section6.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section6.output_section[1].$name                  = ".fiqstack";
section6.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section6.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section6.output_section[1].input_section.create(1);
section6.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section6.output_section[2].$name                  = ".svcstack";
section6.output_section[2].output_sections_start  = "__SVC_STACK_START";
section6.output_section[2].output_sections_end    = "__SVC_STACK_END";
section6.output_section[2].input_section.create(1);
section6.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section6.output_section[3].$name                  = ".abortstack";
section6.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section6.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section6.output_section[3].input_section.create(1);
section6.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section6.output_section[4].$name                  = ".undefinedstack";
section6.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section6.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section6.output_section[4].input_section.create(1);
section6.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section7.load_memory                  = "OCRAM";
section7.$name                        = "Initialization and Exception Handling";
section7.output_section.create(3);
section7.output_section[0].$name      = ".ARM.exidx";
section7.output_section[0].palignment = true;
section7.output_section[1].$name      = ".init_array";
section7.output_section[1].palignment = true;
section7.output_section[2].$name      = ".fini_array";
section7.output_section[2].palignment = true;

section8.load_memory                 = "USER_SHM_MEM";
section8.type                        = "NOLOAD";
section8.$name                       = "User Shared Memory";
section8.group                       = false;
section8.output_section.create(1);
section8.output_section[0].$name     = ".bss.user_shared_mem";
section8.output_section[0].alignment = 0;

section9.load_memory                 = "LOG_SHM_MEM";
section9.$name                       = "Log Shared Memory";
section9.group                       = false;
section9.type                        = "NOLOAD";
section9.output_section.create(1);
section9.output_section[0].$name     = ".bss.log_shared_mem";
section9.output_section[0].alignment = 0;

section10.load_memory                 = "RTOS_NORTOS_IPC_SHM_MEM";
section10.type                        = "NOLOAD";
section10.$name                       = "IPC Shared Memory";
section10.group                       = false;
section10.output_section.create(1);
section10.output_section[0].$name     = ".bss.ipc_vring_mem";
section10.output_section[0].alignment = 0;

section11.load_memory                 = "MAILBOX_HSM";
section11.type                        = "NOLOAD";
section11.$name                       = "SIPC HSM Queue Memory";
section11.group                       = false;
section11.output_section.create(1);
section11.output_section[0].$name     = ".bss.sipc_hsm_queue_mem";
section11.output_section[0].alignment = 0;

section12.load_memory                 = "MAILBOX_R5F";
section12.$name                       = "SIPC R5F Queue Memory";
section12.group                       = false;
section12.type                        = "NOLOAD";
section12.output_section.create(1);
section12.output_section[0].$name     = ".bss.sipc_secure_host_queue_mem";
section12.output_section[0].alignment = 0;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
ram1.parallelRamDriver.psramDriverIoExpander.I2C.SCL.$suggestSolution  = "UART0_RTSn";
ram1.parallelRamDriver.psramDriverIoExpander.I2C.SDA.$suggestSolution  = "UART0_CTSn";
ram1.parallelRamDriver.sleepEnGpioDriver.GPIO_n.$suggestSolution       = "QSPI_CSn0";
ram1.parallelRamDriver.psramDriver.GPMC.$suggestSolution               = "GPMC";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_ADVn_ALE.$suggestSolution = "SDFM0_CLK2";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_BE0n_CLE.$suggestSolution = "PR0_PRU1_GPIO9";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A0.$suggestSolution       = "PR0_PRU0_GPIO4";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A1.$suggestSolution       = "PR0_PRU0_GPIO0";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A2.$suggestSolution       = "PR0_PRU0_GPIO1";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A3.$suggestSolution       = "PR0_PRU0_GPIO2";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A4.$suggestSolution       = "PR0_PRU0_GPIO3";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A5.$suggestSolution       = "PR0_PRU0_GPIO16";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A6.$suggestSolution       = "PR0_PRU0_GPIO15";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A7.$suggestSolution       = "PR0_PRU0_GPIO11";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A8.$suggestSolution       = "PR0_PRU0_GPIO12";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A9.$suggestSolution       = "PR0_PRU0_GPIO13";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A10.$suggestSolution      = "PR0_PRU0_GPIO14";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A11.$suggestSolution      = "PR0_PRU1_GPIO6";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A12.$suggestSolution      = "PR0_PRU1_GPIO4";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A13.$suggestSolution      = "PR0_PRU1_GPIO0";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A14.$suggestSolution      = "PR0_PRU1_GPIO1";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A15.$suggestSolution      = "PR0_PRU1_GPIO2";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A16.$suggestSolution      = "PR0_PRU1_GPIO3";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A17.$suggestSolution      = "PR0_PRU1_GPIO16";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A18.$suggestSolution      = "PR0_PRU1_GPIO15";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A19.$suggestSolution      = "PR0_PRU1_GPIO11";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A20.$suggestSolution      = "PR0_PRU1_GPIO12";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_A21.$suggestSolution      = "PR0_PRU1_GPIO13";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_BE1n.$suggestSolution     = "PR0_PRU1_GPIO10";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD0.$suggestSolution      = "EPWM13_A";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD1.$suggestSolution      = "EPWM13_B";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD2.$suggestSolution      = "EPWM14_A";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD3.$suggestSolution      = "EPWM14_B";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD4.$suggestSolution      = "EPWM15_A";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD5.$suggestSolution      = "EPWM15_B";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD6.$suggestSolution      = "UART1_RXD";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD7.$suggestSolution      = "UART1_TXD";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD8.$suggestSolution      = "MMC_CLK";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD9.$suggestSolution      = "MMC_CMD";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD10.$suggestSolution     = "MMC_DAT0";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD11.$suggestSolution     = "MMC_DAT1";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD12.$suggestSolution     = "MMC_DAT2";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD13.$suggestSolution     = "MMC_DAT3";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD14.$suggestSolution     = "MMC_SDWP";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_AD15.$suggestSolution     = "MMC_SDCD";
ram1.parallelRamDriver.psramDriver.GPMC.GPMC_WAIT0.$suggestSolution    = "PR0_PRU0_GPIO10";
gpio2.GPIO_n.$suggestSolution                                          = "QSPI_CSn1";
